_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_8 (InputLayer)         (None, 4, 150, 1)         0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 4, 114, 50)        1900      
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 4, 57, 50)         0         
_________________________________________________________________
dropout_15 (Dropout)         (None, 4, 57, 50)         0         
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 4, 21, 50)         92550     
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 4, 10, 50)         0         
_________________________________________________________________
dropout_16 (Dropout)         (None, 4, 10, 50)         0         
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 4, 1, 20)          10020     
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 1, 1, 200)         16200     
_________________________________________________________________
reshape_8 (Reshape)          (None, 200)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 5)                 1005      
=================================================================
Total params: 121,675
Trainable params: 121,675
Non-trainable params: 0
_________________________________________________________________

0.9347826086956522
0.879746835443038
0.8734177215189873