_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 4, 150, 1)         0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 4, 114, 50)        1900      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 4, 57, 50)         0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 4, 57, 50)         0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 4, 21, 50)         92550     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 4, 10, 50)         0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 4, 10, 50)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 4, 1, 20)          10020     
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 1, 1, 200)         16200     
_________________________________________________________________
reshape_3 (Reshape)          (None, 200)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 5)                 1005      
=================================================================
Total params: 121,675
Trainable params: 121,675
Non-trainable params: 0
_________________________________________________________________

0.9637681159420289
0.9367088607594937
0.8987341772151899