_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 3, 150, 1)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 3, 114, 50)        1900      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 3, 57, 50)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 3, 57, 50)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 21, 50)         92550     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 10, 50)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 3, 10, 50)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 1, 40)          20040     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 1, 1, 600)         72600     
_________________________________________________________________
reshape_1 (Reshape)          (None, 600)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 3005      
=================================================================
Total params: 190,095
Trainable params: 190,095
Non-trainable params: 0
_________________________________________________________________

0.9915433403805497
0.8734177215189873
0.1962025316455696