_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 4, 150, 1)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 4, 114, 50)        1900      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 57, 50)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4, 57, 50)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 4, 21, 50)         92550     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 4, 10, 50)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 4, 10, 50)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 1, 20)          10020     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 1, 1, 400)         32400     
_________________________________________________________________
reshape_1 (Reshape)          (None, 400)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 2005      
=================================================================
Total params: 138,875
Trainable params: 138,875
Non-trainable params: 0
_________________________________________________________________

0.9148550724637681
0.9113924050632911
0.8734177215189873