_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_9 (InputLayer)         (None, 4, 150, 1)         0         
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 4, 114, 50)        1900      
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 4, 57, 50)         0         
_________________________________________________________________
dropout_17 (Dropout)         (None, 4, 57, 50)         0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 4, 21, 50)         92550     
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 4, 10, 50)         0         
_________________________________________________________________
dropout_18 (Dropout)         (None, 4, 10, 50)         0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 4, 1, 20)          10020     
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 1, 1, 200)         16200     
_________________________________________________________________
reshape_9 (Reshape)          (None, 200)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 5)                 1005      
=================================================================
Total params: 121,675
Trainable params: 121,675
Non-trainable params: 0
_________________________________________________________________

0.9619565217391305
0.8860759493670886
0.8860759493670886