_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         (None, 4, 150, 1)         0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 4, 106, 50)        2300      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 4, 53, 50)         0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 4, 53, 50)         0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 4, 9, 50)          112550    
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 4, 4, 50)          0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 4, 4, 50)          0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 4, 1, 20)          4020      
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 1, 1, 200)         16200     
_________________________________________________________________
reshape_5 (Reshape)          (None, 200)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 5)                 1005      
=================================================================
Total params: 136,075
Trainable params: 136,075
Non-trainable params: 0
_________________________________________________________________

0.9456521739130435
0.8860759493670886
0.8607594936708861