_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 3, 150, 1)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 3, 114, 50)        1900      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 3, 57, 50)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 3, 57, 50)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 3, 21, 50)         92550     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 3, 10, 50)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 3, 10, 50)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 3, 1, 20)          10020     
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 1, 1, 400)         24400     
_________________________________________________________________
reshape_2 (Reshape)          (None, 400)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 5)                 2005      
=================================================================
Total params: 130,875
Trainable params: 130,875
Non-trainable params: 0
_________________________________________________________________

0.947463768115942
0.6265822784810127
0.6455696202531646