_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 3, 150, 1)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 3, 114, 50)        1900      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 3, 57, 50)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 3, 57, 50)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 21, 50)         92550     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 10, 50)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 3, 10, 50)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 1, 20)          10020     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 1, 1, 200)         12200     
_________________________________________________________________
reshape_1 (Reshape)          (None, 200)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 1005      
=================================================================
Total params: 117,675
Trainable params: 117,675
Non-trainable params: 0
_________________________________________________________________

0.9217758985200846
0.879746835443038
0.26582278481012656