_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 3, 150, 1)         0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 3, 114, 30)        1140      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 3, 57, 30)         0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 3, 57, 30)         0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 3, 21, 30)         33330     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 3, 10, 30)         0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 3, 10, 30)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 3, 1, 10)          3010      
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 1, 1, 400)         12400     
_________________________________________________________________
reshape_3 (Reshape)          (None, 400)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 1604      
=================================================================
Total params: 51,484
Trainable params: 51,484
Non-trainable params: 0
_________________________________________________________________

0.9883268482490273
0.918918918918919
0.2702702702702703