_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 3, 150, 1)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 3, 136, 50)        800       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 3, 68, 50)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 3, 68, 50)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 54, 50)         37550     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 27, 50)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 3, 27, 50)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 1, 20)          27020     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 1, 1, 600)         36600     
_________________________________________________________________
reshape_1 (Reshape)          (None, 600)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 2404      
=================================================================
Total params: 104,374
Trainable params: 104,374
Non-trainable params: 0
_________________________________________________________________

1.0
0.972972972972973
0.2702702702702703