_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 3, 150, 1)         0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 3, 121, 50)        1550      
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 3, 60, 50)         0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 3, 60, 50)         0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 3, 31, 50)         75050     
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 3, 15, 50)         0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 3, 15, 50)         0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 3, 1, 20)          15020     
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 1, 1, 200)         12200     
_________________________________________________________________
reshape_4 (Reshape)          (None, 200)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 4)                 804       
=================================================================
Total params: 104,624
Trainable params: 104,624
Non-trainable params: 0
_________________________________________________________________

0.9922178988326849
0.9324324324324325
0.2702702702702703