_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 5, 150, 1)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 5, 114, 50)        1900      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 57, 50)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 5, 57, 50)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 5, 21, 50)         92550     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 5, 10, 50)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 5, 10, 50)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 5, 1, 10)          5010      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 1, 1, 600)         30600     
_________________________________________________________________
reshape_1 (Reshape)          (None, 600)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 3005      
=================================================================
Total params: 133,065
Trainable params: 133,065
Non-trainable params: 0
_________________________________________________________________

0.9894291754756871
0.8860759493670886
0.26582278481012656