_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_6 (InputLayer)         (None, 4, 150, 1)         0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 4, 114, 50)        1900      
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 4, 57, 50)         0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 4, 57, 50)         0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 4, 21, 50)         92550     
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 4, 10, 50)         0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 4, 10, 50)         0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 4, 1, 20)          10020     
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 1, 1, 200)         16200     
_________________________________________________________________
reshape_6 (Reshape)          (None, 200)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 5)                 1005      
=================================================================
Total params: 121,675
Trainable params: 121,675
Non-trainable params: 0
_________________________________________________________________

0.9619565217391305
0.9113924050632911
0.9113924050632911