_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 6, 150, 1)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 6, 114, 50)        1900      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 6, 57, 50)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 6, 57, 50)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 6, 21, 50)         92550     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 6, 10, 50)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 6, 10, 50)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 6, 1, 20)          10020     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 1, 1, 400)         48400     
_________________________________________________________________
reshape_1 (Reshape)          (None, 400)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 2005      
=================================================================
Total params: 154,875
Trainable params: 154,875
Non-trainable params: 0
_________________________________________________________________

0.25905797101449274
0.25949367088607594
0.26582278481012656