_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 3, 150, 1)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 3, 114, 50)        1900      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 3, 57, 50)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 3, 57, 50)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 3, 21, 50)         92550     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 3, 10, 50)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 3, 10, 50)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 3, 1, 20)          10020     
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 1, 1, 800)         48800     
_________________________________________________________________
reshape_2 (Reshape)          (None, 800)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 5)                 4005      
=================================================================
Total params: 157,275
Trainable params: 157,275
Non-trainable params: 0
_________________________________________________________________

0.9619450317124736
0.8987341772151899
0.25949367088607594