_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 4, 150, 1)         0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 4, 121, 50)        1550      
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 4, 60, 50)         0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 4, 60, 50)         0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 4, 31, 50)         75050     
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 4, 15, 50)         0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 4, 15, 50)         0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 4, 1, 20)          15020     
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 1, 1, 200)         16200     
_________________________________________________________________
reshape_4 (Reshape)          (None, 200)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 5)                 1005      
=================================================================
Total params: 108,825
Trainable params: 108,825
Non-trainable params: 0
_________________________________________________________________

0.9746376811594203
0.9240506329113924
0.8734177215189873