_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 3, 150, 1)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 3, 121, 50)        1550      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 3, 60, 50)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 3, 60, 50)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 31, 50)         75050     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 15, 50)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 3, 15, 50)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 1, 20)          15020     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 1, 1, 600)         36600     
_________________________________________________________________
reshape_1 (Reshape)          (None, 600)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 3005      
=================================================================
Total params: 131,225
Trainable params: 131,225
Non-trainable params: 0
_________________________________________________________________

0.9577167019027484
0.8924050632911392
0.44936708860759494