_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 3, 150, 1)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 3, 129, 50)        1150      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 3, 64, 50)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 3, 64, 50)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 3, 43, 50)         55050     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 21, 50)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 3, 21, 50)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 3, 1, 20)          21020     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 1, 1, 600)         36600     
_________________________________________________________________
reshape_1 (Reshape)          (None, 600)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 3005      
=================================================================
Total params: 116,825
Trainable params: 116,825
Non-trainable params: 0
_________________________________________________________________

0.9090909090909091
0.8860759493670886
0.13924050632911392