_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 4, 150, 1)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 4, 114, 50)        1900      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 4, 57, 50)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 4, 57, 50)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 4, 21, 50)         92550     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 4, 10, 50)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 4, 10, 50)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 4, 1, 20)          10020     
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 1, 1, 200)         16200     
_________________________________________________________________
reshape_2 (Reshape)          (None, 200)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 5)                 1005      
=================================================================
Total params: 121,675
Trainable params: 121,675
Non-trainable params: 0
_________________________________________________________________

0.9710144927536232
0.9113924050632911
0.8987341772151899