_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 2, 150, 1)         0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 2, 114, 50)        1900      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 2, 57, 50)         0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 2, 57, 50)         0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 2, 21, 50)         92550     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 2, 10, 50)         0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 2, 10, 50)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 2, 1, 20)          10020     
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 1, 1, 400)         16400     
_________________________________________________________________
reshape_3 (Reshape)          (None, 400)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 5)                 2005      
=================================================================
Total params: 122,875
Trainable params: 122,875
Non-trainable params: 0
_________________________________________________________________

0.6304347826086957
0.569620253164557
0.5822784810126582