_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_7 (InputLayer)         (None, 4, 150, 1)         0         
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 4, 114, 50)        1900      
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 4, 57, 50)         0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 4, 57, 50)         0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 4, 21, 50)         92550     
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 4, 10, 50)         0         
_________________________________________________________________
dropout_14 (Dropout)         (None, 4, 10, 50)         0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 4, 1, 20)          10020     
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 1, 1, 100)         8100      
_________________________________________________________________
reshape_7 (Reshape)          (None, 100)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 5)                 505       
=================================================================
Total params: 113,075
Trainable params: 113,075
Non-trainable params: 0
_________________________________________________________________

0.9021739130434783
0.8924050632911392
0.8860759493670886